tutorials/multiphaseEuler/boilingBed/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.gas       0;
    alpha.liquid    1;
    alpha.solid     0;
}

zones
{
    bed
    {
        type            lookup;
        zoneType        cell;

        values
        {
            alpha.gas       0;
            alpha.liquid    0.4;
            alpha.solid     0.6;
        }
    }
}

// ************************************************************************* //
